# InsulationThickness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..InsulationThickness Property
FabricationPart Class See Also
---
The insulation thickness of the fabrication part. If the fabrication part is not insulated, returns zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double InsulationThickness { get; }
```

Visual Basic
---
```text
Public ReadOnly Property InsulationThickness As Double
	Get
```

Visual C++
---
```text
public:
property double InsulationThickness {
	double get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace